## Листове: Създава се празен лист, потребителя въвежда колко елементи ще има в листа
## запълва се листа с цели числа, които се въвеждат от потребителя. Първа обработка:
## Намираме сумата на тези елементи от списъка, чиято стойност е положителна и чиято цифра
## десетиците е кратна на 3. Намери индекса на елемента с най-голямото отрицателно стойност.
number_of_elements = int(input())
l = []
for i in range(number_of_elements):
    l.append(int(input()))

sum_of_list = sum([l[x] for x in range(len(l)) if l[x] >= 10 and ((l[x]//10)%10)%3==0])
print(sum_of_list)

print(l.index(max([x for x in l if x < 0])))
