//Да се напише програма, която прочита едно число и изкарва числова пирамида. Например ако числото е 3 пирамидата ще започне на първи ред с една единица, на втори ред ще има две двойки, а на трети ред ще има три тройки. Ако числото е 5, пирамидата ще започне на първи ред с една единица, на втори ред ще има две двойки, на трети ред ще има три тройки, на четвърти ред ще има четири четворки и на пети ред ще има пет петици.
#include <stdio.h>

int main() {
    int n;
    printf("Enter a number: ");
    scanf("%d", &n);
    
    for (int i = 1; i <= n; i++) {
        for (int j = 1; j <= i; j++) {
            printf("%d ", i);
        }
        printf("\n");
    }
    
    return 0;
}